{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.7.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 300, 300, 3], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 384, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 64, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of261.bin", "group1-shard2of261.bin", "group1-shard3of261.bin", "group1-shard4of261.bin", "group1-shard5of261.bin", "group1-shard6of261.bin", "group1-shard7of261.bin", "group1-shard8of261.bin", "group1-shard9of261.bin", "group1-shard10of261.bin", "group1-shard11of261.bin", "group1-shard12of261.bin", "group1-shard13of261.bin", "group1-shard14of261.bin", "group1-shard15of261.bin", "group1-shard16of261.bin", "group1-shard17of261.bin", "group1-shard18of261.bin", "group1-shard19of261.bin", "group1-shard20of261.bin", "group1-shard21of261.bin", "group1-shard22of261.bin", "group1-shard23of261.bin", "group1-shard24of261.bin", "group1-shard25of261.bin", "group1-shard26of261.bin", "group1-shard27of261.bin", "group1-shard28of261.bin", "group1-shard29of261.bin", "group1-shard30of261.bin", "group1-shard31of261.bin", "group1-shard32of261.bin", "group1-shard33of261.bin", "group1-shard34of261.bin", "group1-shard35of261.bin", "group1-shard36of261.bin", "group1-shard37of261.bin", "group1-shard38of261.bin", "group1-shard39of261.bin", "group1-shard40of261.bin", "group1-shard41of261.bin", "group1-shard42of261.bin", "group1-shard43of261.bin", "group1-shard44of261.bin", "group1-shard45of261.bin", "group1-shard46of261.bin", "group1-shard47of261.bin", "group1-shard48of261.bin", "group1-shard49of261.bin", "group1-shard50of261.bin", "group1-shard51of261.bin", "group1-shard52of261.bin", "group1-shard53of261.bin", "group1-shard54of261.bin", "group1-shard55of261.bin", "group1-shard56of261.bin", "group1-shard57of261.bin", "group1-shard58of261.bin", "group1-shard59of261.bin", "group1-shard60of261.bin", "group1-shard61of261.bin", "group1-shard62of261.bin", "group1-shard63of261.bin", "group1-shard64of261.bin", "group1-shard65of261.bin", "group1-shard66of261.bin", "group1-shard67of261.bin", "group1-shard68of261.bin", "group1-shard69of261.bin", "group1-shard70of261.bin", "group1-shard71of261.bin", "group1-shard72of261.bin", "group1-shard73of261.bin", "group1-shard74of261.bin", "group1-shard75of261.bin", "group1-shard76of261.bin", "group1-shard77of261.bin", "group1-shard78of261.bin", "group1-shard79of261.bin", "group1-shard80of261.bin", "group1-shard81of261.bin", "group1-shard82of261.bin", "group1-shard83of261.bin", "group1-shard84of261.bin", "group1-shard85of261.bin", "group1-shard86of261.bin", "group1-shard87of261.bin", "group1-shard88of261.bin", "group1-shard89of261.bin", "group1-shard90of261.bin", "group1-shard91of261.bin", "group1-shard92of261.bin", "group1-shard93of261.bin", "group1-shard94of261.bin", "group1-shard95of261.bin", "group1-shard96of261.bin", "group1-shard97of261.bin", "group1-shard98of261.bin", "group1-shard99of261.bin", "group1-shard100of261.bin", "group1-shard101of261.bin", "group1-shard102of261.bin", "group1-shard103of261.bin", "group1-shard104of261.bin", "group1-shard105of261.bin", "group1-shard106of261.bin", "group1-shard107of261.bin", "group1-shard108of261.bin", "group1-shard109of261.bin", "group1-shard110of261.bin", "group1-shard111of261.bin", "group1-shard112of261.bin", "group1-shard113of261.bin", "group1-shard114of261.bin", "group1-shard115of261.bin", "group1-shard116of261.bin", "group1-shard117of261.bin", "group1-shard118of261.bin", "group1-shard119of261.bin", "group1-shard120of261.bin", "group1-shard121of261.bin", "group1-shard122of261.bin", "group1-shard123of261.bin", "group1-shard124of261.bin", "group1-shard125of261.bin", "group1-shard126of261.bin", "group1-shard127of261.bin", "group1-shard128of261.bin", "group1-shard129of261.bin", "group1-shard130of261.bin", "group1-shard131of261.bin", "group1-shard132of261.bin", "group1-shard133of261.bin", "group1-shard134of261.bin", "group1-shard135of261.bin", "group1-shard136of261.bin", "group1-shard137of261.bin", "group1-shard138of261.bin", "group1-shard139of261.bin", "group1-shard140of261.bin", "group1-shard141of261.bin", "group1-shard142of261.bin", "group1-shard143of261.bin", "group1-shard144of261.bin", "group1-shard145of261.bin", "group1-shard146of261.bin", "group1-shard147of261.bin", "group1-shard148of261.bin", "group1-shard149of261.bin", "group1-shard150of261.bin", "group1-shard151of261.bin", "group1-shard152of261.bin", "group1-shard153of261.bin", "group1-shard154of261.bin", "group1-shard155of261.bin", "group1-shard156of261.bin", "group1-shard157of261.bin", "group1-shard158of261.bin", "group1-shard159of261.bin", "group1-shard160of261.bin", "group1-shard161of261.bin", "group1-shard162of261.bin", "group1-shard163of261.bin", "group1-shard164of261.bin", "group1-shard165of261.bin", "group1-shard166of261.bin", "group1-shard167of261.bin", "group1-shard168of261.bin", "group1-shard169of261.bin", "group1-shard170of261.bin", "group1-shard171of261.bin", "group1-shard172of261.bin", "group1-shard173of261.bin", "group1-shard174of261.bin", "group1-shard175of261.bin", "group1-shard176of261.bin", "group1-shard177of261.bin", "group1-shard178of261.bin", "group1-shard179of261.bin", "group1-shard180of261.bin", "group1-shard181of261.bin", "group1-shard182of261.bin", "group1-shard183of261.bin", "group1-shard184of261.bin", "group1-shard185of261.bin", "group1-shard186of261.bin", "group1-shard187of261.bin", "group1-shard188of261.bin", "group1-shard189of261.bin", "group1-shard190of261.bin", "group1-shard191of261.bin", "group1-shard192of261.bin", "group1-shard193of261.bin", "group1-shard194of261.bin", "group1-shard195of261.bin", "group1-shard196of261.bin", "group1-shard197of261.bin", "group1-shard198of261.bin", "group1-shard199of261.bin", "group1-shard200of261.bin", "group1-shard201of261.bin", "group1-shard202of261.bin", "group1-shard203of261.bin", "group1-shard204of261.bin", "group1-shard205of261.bin", "group1-shard206of261.bin", "group1-shard207of261.bin", "group1-shard208of261.bin", "group1-shard209of261.bin", "group1-shard210of261.bin", "group1-shard211of261.bin", "group1-shard212of261.bin", "group1-shard213of261.bin", "group1-shard214of261.bin", "group1-shard215of261.bin", "group1-shard216of261.bin", "group1-shard217of261.bin", "group1-shard218of261.bin", "group1-shard219of261.bin", "group1-shard220of261.bin", "group1-shard221of261.bin", "group1-shard222of261.bin", "group1-shard223of261.bin", "group1-shard224of261.bin", "group1-shard225of261.bin", "group1-shard226of261.bin", "group1-shard227of261.bin", "group1-shard228of261.bin", "group1-shard229of261.bin", "group1-shard230of261.bin", "group1-shard231of261.bin", "group1-shard232of261.bin", "group1-shard233of261.bin", "group1-shard234of261.bin", "group1-shard235of261.bin", "group1-shard236of261.bin", "group1-shard237of261.bin", "group1-shard238of261.bin", "group1-shard239of261.bin", "group1-shard240of261.bin", "group1-shard241of261.bin", "group1-shard242of261.bin", "group1-shard243of261.bin", "group1-shard244of261.bin", "group1-shard245of261.bin", "group1-shard246of261.bin", "group1-shard247of261.bin", "group1-shard248of261.bin", "group1-shard249of261.bin", "group1-shard250of261.bin", "group1-shard251of261.bin", "group1-shard252of261.bin", "group1-shard253of261.bin", "group1-shard254of261.bin", "group1-shard255of261.bin", "group1-shard256of261.bin", "group1-shard257of261.bin", "group1-shard258of261.bin", "group1-shard259of261.bin", "group1-shard260of261.bin", "group1-shard261of261.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "dense/kernel", "shape": [710432, 384], "dtype": "float32"}, {"name": "dense/bias", "shape": [384], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [384, 64], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 5], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [5], "dtype": "float32"}]}]}